# ExternalServiceId Constructor

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExternalServiceId Constructor
ExternalServiceId Class See Also
---
Creates a new ExternalServiceId instance.
**Namespace:** Autodesk.Revit.DB.ExternalService**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public ExternalServiceId(
	Guid guid
)
```

Visual Basic
---
```text
Public Sub New ( _
	guid As Guid _
)
```

Visual C++
---
```text
public:
ExternalServiceId(
	Guid guid
)
```

# ### Parameters
guid
    Type: System..::..GuidThe identifier for the ExternalServiceId.
# See Also
ExternalServiceId Class
Autodesk.Revit.DB.ExternalService Namespace